Revit 2026 API

# DisplacementElementGetAdditionalElementsToDisplace Method

---

Identify a set of elements that potentially should be displaced along with a given element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> GetAdditionalElementsToDisplace(
	Document document,
	View view,
	ElementId idToDisplace
)
```
```vb
Public Shared Function GetAdditionalElementsToDisplace (
	document As Document,
	view As View,
	idToDisplace As ElementId
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ GetAdditionalElementsToDisplace(
	Document^ document,
	View^ view,
	ElementId^ idToDisplace
)
```
```fsharp
static member GetAdditionalElementsToDisplace :
        document : Document *
        view : View *
        idToDisplace : ElementId -> ICollection<ElementId>
```

#### Parameters

document Document
     the document
view View
     the view
idToDisplace ElementId
     element id of element to displace

#### Return Value

ICollectionElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

For example, when a wall is displaced, any inserts or hosted elements should also be displaced.

#### Reference

DisplacementElement Class

Autodesk.Revit.DB Namespace